#str - string - (строка) "jfjgfnjvvj" ""' 
#int - integer - (целые числа) - 1,2,3,4,5
#float - floating - (не целые числа) - 1.4, 1.9
#bool - boolean - (логический тип данных) (True/false)

#Арифметические операторы: 
print (5+5) #Сложение
print (5-2) #Вычитание
print (5*2) #Умножение
print (10/2) #Деление
print (11//2) #Деление нечетного числа на четное без останка
print (11%2) 

#print(5==5) - знак равно
#print(5!=5) - знак не равно
# 5 > 3 - знак больше
# 5 < 3 - знак меньше
# 5 <= 3 - знак меньше или равно
# 5 >= 3 - знак больше или равно 


#print("Привет всем")

#input - запрашивает данные у пользователя
#name = input("Введите ваше имя: ")
#print("Привет", name) 

#name = "Alina"
#age = 15
#print("Привет",name,"тебе",age,"лет" )

#print(f"Привет {name},тебе {age} лет")
#f = форматирование строки, которая дает возможность использовать переменные в строке

#Конкатенация - это смешивание строк
#print("Привет" + name, "тебе" + age, "лет")

#Индексы 
#name = "Kyrgyzstan"
       #0123456789

#print(name[3])

#срезы
#print(name[0:6])

#text = "Вместе мы сможем только преобрvазовав один тип к другому"
#print(text.index("v"))
#print(text[30])

#Условные операторы
#if - "если", используется только в начале условия(задачи), используется в одном условии(задачи) только один раз
#elif - "если", используется в середине условия, можно сипользовать без ограничений
#else - "Иначе", используется в конце условия, можно использовать только один раз

# num1 = int(input("Введите число:")) #"int"-обязательно ставить, чтобы были только числа
# if num1 %2 ==0: 
#     print("Число четное")
# else:
#     print("Число нечетное")
#num1 = int(input("Введите число:"))
#if num1 >0:
#    print("Число положительное")
#elif num1 == 0:
#    print("Число равно нулю")
#else:
#    print("Число отрицательное")

